Repository: alxvmr/passwordchecker
Catalog: locales/*/passwordchecker.po
Languages: ru

source: Connection settings have been successfully changed
ru: Настройки соединения успешно изменены

source: Unable to change connection settings
ru: Не удалось изменить параметры соединения

source: Time units can't be empty
ru: Поле не может быть пустым

source: Time units can't be negative
ru: Значение не может быть отрицательным

source: The record contains invalid characters
ru: Значение содержит недопустимые символы

source: Application settings have been successfully changed
ru: Настройки приложения успешно изменены

source: Unable to change application settings
ru: Не удалось изменить настройки приложения

source: Application
ru: Приложение

source: Connection
ru: Соединение

source: Notification start time
ru: Время начала напоминаний

source: How much time to warn the user about password expiration
ru: За какое время нужно предупредить пользователя об истечении пароля

source: Frequency of warnings
ru: Частота напоминаний

source: Sets the frequency of password change warning output
ru: Частота вывода напоминаний

source: Apply application settings
ru: Применить параметры приложения

source: LDAP server address
ru: Адрес LDAP сервера (url)

source: Specifies the LDAP server address (e.g. ldap://dc1.domain.test.ru)
ru: Задает адрес LDAP сервера. Например: ldap://dc1.domain.test.ru

source: Search root
ru: Корень поиска (base-dn)

source: Specifies the search root for the desired record (e.g. 'dc=domain,dc=test,dc=ru')
ru: Задает корень поиска для нужной записи. Например: dc=domain,dc=test,dc=ru

source: Change connection settings
ru: Изменить параметры соединения

source: Your password expires on %s
ru: Пароль истекает %s

source: Change password
ru: Изменить пароль

source: Change the notification settings
ru: Изменить настройки уведомлений

source: Password change required
ru: Требуется смена пароля

source: Automatic LDAP url calculation failed
ru: Не удалось автоматически определить адрес LDAP сервера (url)

source: You could specify the data manually in PasswordCheckerSettings
ru: Вы можете вручную определить запись в PasswordCheckerSettings

source: Automatic search root calculation failed
ru: Не удалось автоматически определить корень поиска (base-dn)

source: PasswordChecker: change settings
ru: PasswordChecker: изменение настроек

source: days
ru: дней

source: hours
ru: часов

source: min
ru: минут

source: Enable notifications at system startup
ru: Включить уведомления при запуске системы
